       01 K PIC 9(02).
           88 FND VALUE 1 THRU 89.
           88 EOF VALUE 90.
           88 ERR VALUE 0.
       01 COLLECTION.
           02 FILLER PIC X(10) VALUE 'ITEM 01'.
           02 FILLER PIC X(10) VALUE 'ITEM 02'.
           02 FILLER PIC X(10) VALUE 'ITEM 03'.
           02 FILLER PIC X(10) VALUE 'ITEM 04'.
           02 FILLER PIC X(10) VALUE 'ITEM 05'.
           02 FILLER PIC X(10) VALUE 'ITEM 06'.
           02 FILLER PIC X(10) VALUE 'ITEM 07'.
           02 FILLER PIC X(10) VALUE 'ITEM 08'.
           02 FILLER PIC X(10) VALUE 'ITEM 09'.
           02 FILLER PIC X(10) VALUE 'ITEM 10'.
           02 FILLER PIC X(10) VALUE 'ITEM 11'.
           02 FILLER PIC X(10) VALUE 'ITEM 12'.
           02 FILLER PIC X(10) VALUE 'ITEM 13'.
           02 FILLER PIC X(10) VALUE 'ITEM 14'.
           02 FILLER PIC X(10) VALUE 'ITEM 15'.
           02 FILLER PIC X(10) VALUE 'ITEM 16'.
           02 FILLER PIC X(10) VALUE 'ITEM 17'.
           02 FILLER PIC X(10) VALUE 'ITEM 18'.
           02 FILLER PIC X(10) VALUE 'ITEM 19'.
           02 FILLER PIC X(10) VALUE 'ITEM 20'.
           02 FILLER PIC X(10) VALUE 'ITEM 21'.
           02 FILLER PIC X(10) VALUE 'ITEM 22'.
           02 FILLER PIC X(10) VALUE 'ITEM 23'.
           02 FILLER PIC X(10) VALUE 'ITEM 24'.
           02 FILLER PIC X(10) VALUE 'ITEM 25'.
           02 FILLER PIC X(10) VALUE 'ITEM 26'.
           02 FILLER PIC X(10) VALUE 'ITEM 27'.
           02 FILLER PIC X(10) VALUE 'ITEM 28'.
           02 FILLER PIC X(10) VALUE 'ITEM 29'.
           02 FILLER PIC X(10) VALUE 'ITEM 30'.
           02 FILLER PIC X(10) VALUE 'ITEM 31'.
           02 FILLER PIC X(10) VALUE 'ITEM 32'.
           02 FILLER PIC X(10) VALUE 'ITEM 33'.
           02 FILLER PIC X(10) VALUE 'ITEM 34'.
           02 FILLER PIC X(10) VALUE 'ITEM 35'.
           02 FILLER PIC X(10) VALUE 'ITEM 36'.
           02 FILLER PIC X(10) VALUE 'ITEM 37'.
           02 FILLER PIC X(10) VALUE 'ITEM 38'.
           02 FILLER PIC X(10) VALUE 'ITEM 39'.
           02 FILLER PIC X(10) VALUE 'ITEM 40'.
           02 FILLER PIC X(10) VALUE 'ITEM 41'.
           02 FILLER PIC X(10) VALUE 'ITEM 42'.
           02 FILLER PIC X(10) VALUE 'ITEM 43'.
           02 FILLER PIC X(10) VALUE 'ITEM 44'.
           02 FILLER PIC X(10) VALUE 'ITEM 45'.
           02 FILLER PIC X(10) VALUE 'ITEM 46'.
           02 FILLER PIC X(10) VALUE 'ITEM 47'.
           02 FILLER PIC X(10) VALUE 'ITEM 48'.
           02 FILLER PIC X(10) VALUE 'ITEM 49'.
           02 FILLER PIC X(10) VALUE 'ITEM 50'.
           02 FILLER PIC X(10) VALUE 'ITEM 51'.
           02 FILLER PIC X(10) VALUE 'ITEM 52'.
           02 FILLER PIC X(10) VALUE 'ITEM 53'.
           02 FILLER PIC X(10) VALUE 'ITEM 54'.
           02 FILLER PIC X(10) VALUE 'ITEM 55'.
           02 FILLER PIC X(10) VALUE 'ITEM 56'.
           02 FILLER PIC X(10) VALUE 'ITEM 57'.
           02 FILLER PIC X(10) VALUE 'ITEM 58'.
           02 FILLER PIC X(10) VALUE 'ITEM 59'.
           02 FILLER PIC X(10) VALUE 'ITEM 60'.
           02 FILLER PIC X(10) VALUE 'ITEM 61'.
           02 FILLER PIC X(10) VALUE 'ITEM 62'.
           02 FILLER PIC X(10) VALUE 'ITEM 63'.
           02 FILLER PIC X(10) VALUE 'ITEM 64'.
           02 FILLER PIC X(10) VALUE 'ITEM 65'.
           02 FILLER PIC X(10) VALUE 'ITEM 66'.
           02 FILLER PIC X(10) VALUE 'ITEM 67'.
           02 FILLER PIC X(10) VALUE 'ITEM 68'.
           02 FILLER PIC X(10) VALUE 'ITEM 69'.
           02 FILLER PIC X(10) VALUE 'ITEM 70'.
           02 FILLER PIC X(10) VALUE 'ITEM 71'.
           02 FILLER PIC X(10) VALUE 'ITEM 72'.
           02 FILLER PIC X(10) VALUE 'ITEM 73'.
           02 FILLER PIC X(10) VALUE 'ITEM 74'.
           02 FILLER PIC X(10) VALUE 'ITEM 75'.
           02 FILLER PIC X(10) VALUE 'ITEM 76'.
           02 FILLER PIC X(10) VALUE 'ITEM 77'.
           02 FILLER PIC X(10) VALUE 'ITEM 78'.
           02 FILLER PIC X(10) VALUE 'ITEM 79'.
           02 FILLER PIC X(10) VALUE 'ITEM 80'.
           02 FILLER PIC X(10) VALUE 'ITEM 81'.
           02 FILLER PIC X(10) VALUE 'ITEM 82'.
           02 FILLER PIC X(10) VALUE 'ITEM 83'.
           02 FILLER PIC X(10) VALUE 'ITEM 84'.
           02 FILLER PIC X(10) VALUE 'ITEM 85'.
           02 FILLER PIC X(10) VALUE 'ITEM 86'.
           02 FILLER PIC X(10) VALUE 'ITEM 87'.
           02 FILLER PIC X(10) VALUE 'ITEM 88'.
           02 FILLER PIC X(10) VALUE 'ITEM 89'.
       01 FILLER REDEFINES COLLECTION.
           02 ITEM   PIC X(10) OCCURS 89 TIMES.
