       01  MAP01I.
           02  FILLER PIC X(12).
           02  TRANSACL    COMP  PIC  S9(4).
           02  TRANSACF    PICTURE X.
           02  FILLER REDEFINES TRANSACF.
             03 TRANSACA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRANSACI  PIC X(4).
           02  TITRFLDL    COMP  PIC  S9(4).
           02  TITRFLDF    PICTURE X.
           02  FILLER REDEFINES TITRFLDF.
             03 TITRFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITRFLDI  PIC X(41).
           02  DATEFLDL    COMP  PIC  S9(4).
           02  DATEFLDF    PICTURE X.
           02  FILLER REDEFINES DATEFLDF.
             03 DATEFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DATEFLDI  PIC X(10).
           02  TIMEFLDL    COMP  PIC  S9(4).
           02  TIMEFLDF    PICTURE X.
           02  FILLER REDEFINES TIMEFLDF.
             03 TIMEFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TIMEFLDI  PIC X(8).
           02  ACTFLDL    COMP  PIC  S9(4).
           02  ACTFLDF    PICTURE X.
           02  FILLER REDEFINES ACTFLDF.
             03 ACTFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTFLDI  PIC X(9).
           02  CODEAL    COMP  PIC  S9(4).
           02  CODEAF    PICTURE X.
           02  FILLER REDEFINES CODEAF.
             03 CODEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CODEAI  PIC X(4).
           02  CODEPL    COMP  PIC  S9(4).
           02  CODEPF    PICTURE X.
           02  FILLER REDEFINES CODEPF.
             03 CODEPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CODEPI  PIC X(4).
           02  SIRENL    COMP  PIC  S9(4).
           02  SIRENF    PICTURE X.
           02  FILLER REDEFINES SIRENF.
             03 SIRENA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SIRENI  PIC X(5).
           02  FONCTIOL    COMP  PIC  S9(4).
           02  FONCTIOF    PICTURE X.
           02  FILLER REDEFINES FONCTIOF.
             03 FONCTIOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FONCTIOI  PIC X(1).
           02  DROITSL    COMP  PIC  S9(4).
           02  DROITSF    PICTURE X.
           02  FILLER REDEFINES DROITSF.
             03 DROITSA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DROITSI  PIC X(9).
           02  DATSIGNL    COMP  PIC  S9(4).
           02  DATSIGNF    PICTURE X.
           02  FILLER REDEFINES DATSIGNF.
             03 DATSIGNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DATSIGNI  PIC X(10).
           02  MSGFLDL    COMP  PIC  S9(4).
           02  MSGFLDF    PICTURE X.
           02  FILLER REDEFINES MSGFLDF.
             03 MSGFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MSGFLDI  PIC X(79).
       01  MAP01O REDEFINES MAP01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRANSACC    PICTURE X.
           02  TRANSACP    PICTURE X.
           02  TRANSACH    PICTURE X.
           02  TRANSACV    PICTURE X.
           02  TRANSACO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITRFLDC    PICTURE X.
           02  TITRFLDP    PICTURE X.
           02  TITRFLDH    PICTURE X.
           02  TITRFLDV    PICTURE X.
           02  TITRFLDO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  DATEFLDC    PICTURE X.
           02  DATEFLDP    PICTURE X.
           02  DATEFLDH    PICTURE X.
           02  DATEFLDV    PICTURE X.
           02  DATEFLDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  TIMEFLDC    PICTURE X.
           02  TIMEFLDP    PICTURE X.
           02  TIMEFLDH    PICTURE X.
           02  TIMEFLDV    PICTURE X.
           02  TIMEFLDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACTFLDC    PICTURE X.
           02  ACTFLDP    PICTURE X.
           02  ACTFLDH    PICTURE X.
           02  ACTFLDV    PICTURE X.
           02  ACTFLDO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  CODEAC    PICTURE X.
           02  CODEAP    PICTURE X.
           02  CODEAH    PICTURE X.
           02  CODEAV    PICTURE X.
           02  CODEAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  CODEPC    PICTURE X.
           02  CODEPP    PICTURE X.
           02  CODEPH    PICTURE X.
           02  CODEPV    PICTURE X.
           02  CODEPO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SIRENC    PICTURE X.
           02  SIRENP    PICTURE X.
           02  SIRENH    PICTURE X.
           02  SIRENV    PICTURE X.
           02  SIRENO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  FONCTIOC    PICTURE X.
           02  FONCTIOP    PICTURE X.
           02  FONCTIOH    PICTURE X.
           02  FONCTIOV    PICTURE X.
           02  FONCTIOO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DROITSC    PICTURE X.
           02  DROITSP    PICTURE X.
           02  DROITSH    PICTURE X.
           02  DROITSV    PICTURE X.
           02  DROITSO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  DATSIGNC    PICTURE X.
           02  DATSIGNP    PICTURE X.
           02  DATSIGNH    PICTURE X.
           02  DATSIGNV    PICTURE X.
           02  DATSIGNO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MSGFLDC    PICTURE X.
           02  MSGFLDP    PICTURE X.
           02  MSGFLDH    PICTURE X.
           02  MSGFLDV    PICTURE X.
           02  MSGFLDO  PIC X(79).
