       01  MAP01I.
           02  FILLER PIC X(12).
           02  TRANSACL    COMP  PIC  S9(4).
           02  TRANSACF    PICTURE X.
           02  FILLER REDEFINES TRANSACF.
             03 TRANSACA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRANSACI  PIC X(4).
           02  TITRFLDL    COMP  PIC  S9(4).
           02  TITRFLDF    PICTURE X.
           02  FILLER REDEFINES TITRFLDF.
             03 TITRFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITRFLDI  PIC X(41).
           02  DATEFLDL    COMP  PIC  S9(4).
           02  DATEFLDF    PICTURE X.
           02  FILLER REDEFINES DATEFLDF.
             03 DATEFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DATEFLDI  PIC X(10).
           02  TIMEFLDL    COMP  PIC  S9(4).
           02  TIMEFLDF    PICTURE X.
           02  FILLER REDEFINES TIMEFLDF.
             03 TIMEFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TIMEFLDI  PIC X(8).
           02  ACTFLDL    COMP  PIC  S9(4).
           02  ACTFLDF    PICTURE X.
           02  FILLER REDEFINES ACTFLDF.
             03 ACTFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTFLDI  PIC X(9).
           02  CODEAL    COMP  PIC  S9(4).
           02  CODEAF    PICTURE X.
           02  FILLER REDEFINES CODEAF.
             03 CODEAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CODEAI  PIC X(4).
           02  TITREAL    COMP  PIC  S9(4).
           02  TITREAF    PICTURE X.
           02  FILLER REDEFINES TITREAF.
             03 TITREAA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITREAI  PIC X(30).
           02  MSGFLDL    COMP  PIC  S9(4).
           02  MSGFLDF    PICTURE X.
           02  FILLER REDEFINES MSGFLDF.
             03 MSGFLDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MSGFLDI  PIC X(79).
       01  MAP01O REDEFINES MAP01I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRANSACC    PICTURE X.
           02  TRANSACP    PICTURE X.
           02  TRANSACH    PICTURE X.
           02  TRANSACV    PICTURE X.
           02  TRANSACO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITRFLDC    PICTURE X.
           02  TITRFLDP    PICTURE X.
           02  TITRFLDH    PICTURE X.
           02  TITRFLDV    PICTURE X.
           02  TITRFLDO  PIC X(41).
           02  FILLER PICTURE X(3).
           02  DATEFLDC    PICTURE X.
           02  DATEFLDP    PICTURE X.
           02  DATEFLDH    PICTURE X.
           02  DATEFLDV    PICTURE X.
           02  DATEFLDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  TIMEFLDC    PICTURE X.
           02  TIMEFLDP    PICTURE X.
           02  TIMEFLDH    PICTURE X.
           02  TIMEFLDV    PICTURE X.
           02  TIMEFLDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACTFLDC    PICTURE X.
           02  ACTFLDP    PICTURE X.
           02  ACTFLDH    PICTURE X.
           02  ACTFLDV    PICTURE X.
           02  ACTFLDO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  CODEAC    PICTURE X.
           02  CODEAP    PICTURE X.
           02  CODEAH    PICTURE X.
           02  CODEAV    PICTURE X.
           02  CODEAO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITREAC    PICTURE X.
           02  TITREAP    PICTURE X.
           02  TITREAH    PICTURE X.
           02  TITREAV    PICTURE X.
           02  TITREAO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  MSGFLDC    PICTURE X.
           02  MSGFLDP    PICTURE X.
           02  MSGFLDH    PICTURE X.
           02  MSGFLDV    PICTURE X.
           02  MSGFLDO  PIC X(79).
