      *----------------------------------------------------------*
      *    TABLE PERSONNE                                        *
      *                                                          *
      *----------------------------------------------------------*

       01  E-PERSONNE.
      *--------------------------------------  CODE PERSONNE
           05 PE-CODEP            PIC X(04).
      *--------------------------------------  IDENTITE
           05 PE-CODE-TYPE        PIC X(01).
      *--------------------------------------  CODE TYPE
           05 PE-IDENTITE         PIC X(25).
      *--------------------------------------  CODE TYPE
           05 FILLER               PIC X(50).
