//API5SVCS JOB NOTIFY=&SYSUID
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//*
//* ===================== COMPILATION COB SVC ==========================
//*
//* COMPILATION COB SVC A1
//STEPVA1  EXEC COMPCICS,NOMPGM=PGMG1VA1
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC A2
//STEPVA2  EXEC COMPCICS,NOMPGM=PGMG1VA2
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC A3
//STEPVA3  EXEC COMPCICS,NOMPGM=PGMG1VA3
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC A4
//STEPVA4  EXEC COMPCICS,NOMPGM=PGMG1VA4
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC E1
//STEPVE1  EXEC COMPCICS,NOMPGM=PGMG1VE1
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC E2
//STEPVE2  EXEC COMPCICS,NOMPGM=PGMG1VE2
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//* COMPILATION COB SVC E3
//STEPVE3  EXEC COMPCICS,NOMPGM=PGMG1VE3
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
