//API5BMS  JOB DPTM,VSAM,NOTIFY=&SYSUID                                 00010000
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//         EXEC COMPMAP,MAP=MBLG1SM
//STEPEXT.SYSUT1   DD DSN=API5.PROJET.BMS(&MAP),DISP=SHR
//STEPCOP.SYSPUNCH DD DSN=API5.PROJET.CPY(&MAP),DISP=SHR
