//API5COB  JOB NOTIFY=&SYSUID
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//         EXEC COMPCICS,NOMPGM=APIG1DSM
//STEPCIC.SYSIN    DD DSN=API5.PROJET.COB(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API5.PROJET.CPY,DISP=SHR
//
