//API5EBAT JOB NOTIFY=&SYSUID
//*
//STEPRUN  EXEC PGM=IKJEFT01,COND=(4,LT)
//STEPLIB  DD DSN=API5.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*,OUTLIM=1000
//SYSTSPRT DD SYSOUT=*,OUTLIM=2500
//DDENTREE DD DSN=API5.PROJET.VSAM.ALBUM,DISP=SHR
//SYSIN    DD *
1
/*
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(VSAMTODB) PLAN (VSAMTODB) PARMS('11001')
//
